{
  "pluginmetadataversion": 2,
  "name": "PS4 ELF Loader",
  "type": [
    "binaryview"
  ],
  "api": [
  ],
  "description": "PS4 ELF Loader",
  "longdescription": "# PS4 ELF Loader\n\nAuthors: [droogie](https://github.com/droogie), [sen](https://github.com/0bs3n)\n\n_Loader for PS4 ELF binaries._\n\n![](./screenshot.png)\n\nThis is a PS4 ELF binaryview plugin for Binary Ninja.\n\nThis was hacked together via the official ELF view that ships with Binary Ninja, the [OpenOrbis PS4 ELF Specification](https://github.com/OpenOrbis/OpenOrbis-PS4-Toolchain/wiki/PS4-ELF-Specification) and [ps4libdoc](https://github.com/idc/ps4libdoc/tree/header).\n\n## Usage\n\nThis loader is intended to be used with binaries that have already been **decrypted**.\n\nSimply load an a PS4 binary with options, close the standard ELF tab and continue with the PS4 tab enabled to use the loader. Your view name on the top left of the disassembly pane should have a `PS4` prefix.\n\n## Building\n\nBuilding the architecture plugin requires `cmake` 3.9 or above. You will also need the [Binary Ninja API source](https://github.com/Vector35/binaryninja-api).\n\nRun `cmake`. This can be done either from a separate build directory or from the source directory. Once that is complete, run `make` in the build directory to compile the plugin.\n\nThe plugin can be found in the root of the build directory as `libview_ps4.so`, `libview_ps4.dylib` or `libview_ps4.dll` depending on your platform.\n\n## Minimum Version\n\n",
  "license": {
    "name": "MIT",
    "text": "Copyright (c) 2024 droogie,sen\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE."
  },
  "platforms": [
    "Darwin",
    "Linux",
    "Windows"
  ],
  "installinstructions": {
      "Darwin": "",
      "Windows": "",
      "Linux": ""
  },
  "dependencies": {
  },
  "version": "1.0",
  "author": "droogie, sen",
  "minimumbinaryninjaversion": 3164
}
